INSERT INTO students (name, hurigana, nickname, age, email, area, gender)
VALUES
    ('鈴木彩艶', 'すずきざいおん', 'ザイオン', 22, 'zion.suzuki@example.com', '埼玉県', '男性'),
    ('森保一', 'もりやすはじめ', 'ポイチ', 56, 'hajime.moriyasu@example.com', '長崎県', '男性'),
    ('遠藤航', 'えんどうわたる', 'ワタ', 32, 'wata@example.com', '神奈川県', '男性'),
    ('長谷川唯', 'はせがわゆい', 'ハッセー', 29, 'yui.hase@example.com', '埼玉県', '女性'),
    ('澤穂希', 'さわほまれ', 'ホマ', 47, 'homare.sawa@example.com', '東京都', '女性');

INSERT INTO students_courses (student_id, course, start_date, end_date)
VALUES
    (1, 'Javaコース', '2025-12-17 00:00:00', '2026-04-20 00:00:00'),
    (2, 'AWSコース', '2025-10-07 00:00:00', '2026-06-23 00:00:00'),
    (2, 'デザインコース', '2025-10-07 00:00:00', '2026-06-23 00:00:00'),
    (3, '英会話コース', '2026-02-08 00:00:00', '2026-11-12 00:00:00'),
    (3, 'フロントエンドコース', '2026-02-07 16:49:29', '2027-02-07 16:49:29'),
    (3, 'デザインコース', '2025-10-07 00:00:00', '2026-06-23 00:00:00'),
    (4, 'AWSコース', '2026-02-14 00:00:00', '2027-02-14 00:00:00'),
    (4, '英会話コース', '2026-02-15 00:00:00', '2027-02-15 00:00:00'),
    (5, 'WPコース', '2026-02-16 00:00:00', '2027-02-16 00:00:00');